<?php
echo "原題-";
$a0= "人易科技:上 機 測 驗 - 演算法";
echo $a0;
echo "<hr>";
//-----------------------------------------------------------------
$a01=mb_substr($a0,4,1,"utf8");  //取符號
// echo $a01;

$a1=mb_convert_kana("$a01",'A'); //作全形符號轉換
// echo $a1;

$a11=str_replace("$a01",$a1,$a0); //將全形符號替換原本半形符號
echo "修改全形-";
echo $a11;
//-----------------------------------------------------------------
echo "<hr>";
echo "空白修正-";
$a2 = str_replace( " ", "",$a11); //先去除所有空白
// echo $a2;
// echo "<br>";
$a21=str_replace('-',' - ',$a2); //將 - 符號增加空白
echo $a21;
//-----------------------------------------------------------------
echo "<hr>";
echo "印出字元-";
$a3=mb_substr($a21,5,4,"utf8"); // 取"上機測驗" 字元出來
echo $a3;


?>